<template>
	<div id="vip_dobut">
		<img src="./image/vip_dobut.jpg">
		<div class="content">
			<span>大美设计中心私人定制部，总部位于深圳，团队核心人员均为注册室内建造师，线下一对一服务说明：</span>
			<span class="margin-t">沟通说明：</span>
			<p>请您亲往大美设计中心私人定制部进行沟通；</p>
			<p>大美设计师与您进行视频沟通；</p>
			<span class="margin-t">服务说明：</span>
			<p>大美设计师免费现场服务1次，但如果在异地需客户提前准备差旅费；</p>
			<p>如需增加设计师现场服务次数，2次后按2000元/次，每次不超过2天。</p>
			<span class="margin-t">您的会员权益包含的2次免费设计服务内容如下：</span>
			<span class="margin-t">1次整屋装修设计服务</span>
			<p>　　整屋设计服务的内容包含：</p>
			<p>　　　　1.全屋效果图套餐包</p>
			<p>　　全屋效果图套餐包内含一套全屋超清全景效果图， 它能够360度无死角环绕展现整个室内空间设计方案；以及一套全屋4K超清效果图，100%色彩还原，像给您的新家拍照片一样，所有空间均可逼真细腻呈现。</p>
			<p>　　各空间效果图场景内应用展现的主要物品皆为大美软装平台的商品，在大美软装APP中都有对应的组合清单可以直接下单购买。</p>
			<p>　　　　2.轻辅工程套餐包</p>
			<p>　　《室内装饰装修工程施工图》是我司根据您的具体户型和设计方案制作的工程施工的参考图纸，为您另行自理的具体装修工程施工工作提供参考。其中包含平面图、立面图等。</p>
			<p>　　《室内装饰装修工程施工预算清单》是我司根据您的具体户型和设计方案及施工图，结合装饰装修行业市场基础造价体系，对您的装修工程造价进行的估算列表，其中包含对实施该装修工程所涉及的轻辅材料单价、用量、总价及各工种人工成本和组织管理成本的估算。为您另行自理的具体装修工程施工工作提供参考。它与《室内装饰装修主要材料配置清单》、《室内装饰装修软装物品配置清单》一起，构成一个装修工程的所有成本。注：所有家电和家居日用品未包含在内。</p>
			<p>　　　　3.装修主材套餐包</p>
			<p>　　《室内装饰装修主要材料配置清单》是我司根据您的具体户型和设计方案整体效果，挑选出的适合本方案的主要材料配置列表，为您另行自理的具体装修工程施工工作提供参考。包含门、门锁、瓷砖、木地板、洁具、橱柜、厨卫五金、厨卫吊顶、厨房电器等。</p>
			<span class="margin-t">　　该设计服务只能进行一次修改，如果您需要N次修改，我们需要进行N-1次收取会员年费。</span>
			<span class="margin-t">1次软装设计</span>
			<p>　　软装设计服务的内容包含：</p>
			<p>　　　　1.全屋效果图套餐包</p>
			<p>　　全屋效果图套餐包内含一套全屋超清全景效果图， 它能够360度无死角环绕展现整个室内空间设计方案；以及一套全屋4K超清效果图，100%色彩还原，像给您的新家拍照片一样，所有空间均可逼真细腻呈现。</p>
			<p>　　各空间效果图场景内应用展现的主要物品皆为大美软装平台的商品，在大美软装APP中都有对应的组合清单可以直接下单购买。</p>
			<span class="margin-t">　　该设计服务只能进行一次修改，如果您需要N次修改，我们需要进行N-1次收取会员年费。</span>
			<span class="margin-t">住宅平层户型面积收费说明</span>
			<span class="margin-t">您的住宅平层户型面积已经超出“大美软装VIP会员免费设计服务”的面积范围</span>
			<span class="margin-t">“大美软装VIP会员免费设计服务”超出面积收费说明如下：</span>
			<p>150㎡以内   免费</p>
			<p>150㎡-200㎡  额外多缴会员年费的40%</p>
			<p>201㎡-235㎡  额外多缴会员年费的80%</p>
			<p>236㎡-270㎡  额外多缴会员年费的120%</p>
			<p>271㎡-300㎡  额外多缴会员年费的160%</p>
			<p>301㎡-400㎡  额外多缴会员年费的200%</p>
			<p>400㎡以上面积超出“大美软装VIP会员免费设计服务”范围</p>
			<span class="margin-t">备注说明</span>
			<span class="margin-t">我们所服务的建筑类型为住宅，服务的户型为平层户型。</span>
			<p>平层户型：即为户型内部各空间地面装修后完成面高度基本在同一水平面、各空间高度差不超过100mm的常规户型。</p>
		</div>
	</div>
</template>
<style lang="less" scoped>
	@import '../../assets/mixin.less';
	#vip_dobut {
		img {
			width: 100%;
		}
		.content {
			.rem(padding-top,20);
			.rem(padding-left,30);
			.rem(padding-right,30);
			color: #999;
		}
		.margin-t {
			display: block;
			.rem(margin-top,20);
		}
		span {
			.rem(line-height,44);
			.rem(font-size,24);
			color: #333;
		}
		p {
			.rem(line-height,44);
			.rem(font-size,22);
		}
		.p1 {
			.rem(font-size,20);
		}
	}
</style>