SET NAMES UTF8;
#删除数据库
DROP DATABASE IF EXISTS novel;
#创建数据库
CREATE DATABASE novel CHARSET UTF8;
#使用数据库
USE novel;
#创建推荐表
CREATE TABLE novel_recommend(
	rid SMALLINT PRIMARY KEY AUTO_INCREMENT, #编号
	rname VARCHAR(24),                       #书名
	author VARCHAR(12),			 #作者
	state VARCHAR(12),			 #状态
	label VARCHAR(8),			 #标签
	word_count VARCHAR(24),		 #字数
	sourse VARCHAR(24),			 #来源
	subtitle VARCHAR(50),		 #副标题
	detail VARCHAR(128)			 #详情
);
/**插入推荐表数据**/
INSERT INTO novel_recommend VALUES
(1,'同桌凶猛','柳下挥','连载','签约 VIP 都市 都市生活','29.02万','起点男生','过去、畅想未来、梦幻现实，再塑传奇人生！','青梅竹马的同桌竟然成了大明星，又凶又萌。'),
(NULL,'明朝败家子','上山打老虎','连载','签约 VIP 历史 两宋元明','245.08万','起点男生','醒掌天下权，醉卧美人膝，五千年风华烟雨，是非成败转头空！','弘治十一年。这是一个美好的清晨。此时朱厚照初成年。此时王守仁和唐伯虎磨刀霍霍，预备科举。此时小冰河期已经来临，绵长的严寒肆虐着大地。此时在南和伯府里，地主家的傻儿子，南和伯的嫡传继承人方继藩……开始了他没羞没躁的败家人生。'),
(NULL,'全职武神','流浪的蛤蟆','连载','签约 VIP 仙侠 古典仙侠','97.03万','QQ小说','醒掌天下权，醉卧美人膝，五千年风华烟雨，是非成败转头空！','这是一个有侠气的故事…………………………'),
(NULL,'青梅仙道','污泥','连载','签约 免费 仙侠 古典仙侠','32.02万','起点','修仙觅长生，热血任逍遥，踏莲曳波涤剑骨，凭虚御风塑圣魂！','挥手千尺浪，静坐转阴阳。异世成大道，造化玄元光！'),
(NULL,'大劫主','黑山老鬼','连载','签约 VIP 仙侠 修真文明','247.51万','起点','修仙觅长生，热血任逍遥，踏莲曳波涤剑骨，凭虚御风塑圣魂！','　一卷道元真解，三千大道奇经。寒门少年踏仙路，十年苦读意难平。仙榜有吾名！无尽天骄崛起，一剑败尽英雄。不愿逐流从庸众，只求仰首见苍穹。此心本天生！'),
(NULL,'全球高武','老鹰吃小鸡','连载','签约 VIP 都市 艺术超能','97.03万','起点','重生过去、畅想未来、梦幻现实，再塑传奇人生！','地窟入侵，武道崛起。小人物也有大情怀，为生存而战，为守护而战。且看小人物方平，一步步崛起，拯救（忽悠）全世界的故事！'),
(NULL,'开天录','血红','连载','签约 VIP 玄幻 东方玄幻','97.03万','起点','心潮澎湃，无限幻想，迎风挥击千层浪，少年不败热血！','生存，很容易。生活，很艰难。我族，要的不是卑下的生存，而是昂首、高傲的生活。我族，誓不为奴！'),
(NULL,'修真聊天群','骑士的传说','连载','签约 VIP 都市 艺术超能 二次元','97.03万','起点','宋书航意外加入一个仙侠中二病资深患者的交流群，群成员，竟然全部是修真者','　某天，宋书航意外加入了一个仙侠中二病资深患者的交流群，里面的群友们都以‘道友’相称，群名片都是各种府主、洞主、真人、天师。连群主走失的宠物犬都称为大妖犬离家出走。整天聊的是炼丹、闯秘境、炼功经验啥的。　突然有一天，潜水良久的他突然发现……群里每一个群员，竟然全部是修真者，能移山倒海、长生千年的那种！啊啊啊啊，世界观在一夜间彻底崩碎啦！'),
(NULL,'史上最强赘婿','沉默的糕点','连载','签约 VIP 玄幻 东方玄幻','97.03万','QQ小说','心潮澎湃，无限幻想，迎风挥击千层浪，少年不败热血！','穿越异世成为财主家的小白脸赘婿，因太废物被赶出来。于是他发奋图强，找一个更有权有势绝美高贵的豪门千金做了上门女婿。练武是不可能练武的，这辈子都不可能练武，只能靠吃软饭才能维持生活！我要把老婆培养成天下第一高手，谁敢惹我就让我娘子打死你！')
;
#创建推荐小说图片表
CREATE TABLE recommend_picture(
	pid SMALLINT PRIMARY KEY AUTO_INCREMENT, #编号
	purl VARCHAR(24),			 #路径
	title VARCHAR(54)			 #标题
);
#往推荐表中插入数据
INSERT INTO recommend_picture VALUES
(1,'./img/recommended/0.jpg','轮播广告图1'),
(2,'./img/recommended/1.jpg','轮播广告图2'),
(3,'./img/recommended/2.jpg','轮播广告图3'),
(4,'./img/recommended/3.jpg','轮播广告图4'),
(5,'./img/recommended/4.jpg','轮播广告图5'),
(6,'./img/recommended/5.jpg','轮播广告图6'),
(7,'./img/recommended/6.jpg','轮播广告图7'),
(8,'./img/recommended/7.jpg','轮播广告图8'),
(9,'./img/recommended/8.jpg','轮播广告图9')
;
/**用户信息**/
CREATE TABLE novel_user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32),
  email VARCHAR(64),
  phone VARCHAR(16),

  avatar VARCHAR(128),        #头像图片路径
  user_name VARCHAR(32),      #用户名，如王小明
  gender INT                  #性别  0-女  1-男
);
/**用户信息**/
INSERT INTO novel_user VALUES
(NULL, 'dingding', '123456', 'ding@qq.com', '13501234567', 'img/avatar/default.png', '丁伟', '1'),
(NULL, 'dangdang', '123456', 'dang@qq.com', '13501234568', 'img/avatar/default.png', '林当', '1'),
(NULL, 'doudou', '123456', 'dou@qq.com', '13501234569', 'img/avatar/default.png', '窦志强', '1'),
(NULL, 'yaya', '123456', 'ya@qq.com', '13501234560', 'img/avatar/default.png', '秦小雅', '0');

/*首页轮播图表*/
CREATE TABLE banner(
	bid SMALLINT PRIMARY key AUTO_INCREMENT,	#编号
	bname VARCHAR(24),                       #书名
	author VARCHAR(12),			 #作者
	state VARCHAR(12),			 #状态
	label VARCHAR(8),			 #标签
	word_count VARCHAR(24),		 #字数
	subtitle VARCHAR(50),		 #副标题
	detail VARCHAR(128)			 #详情
);

/*轮播图表数据*/
INSERT INTO banner VALUES
(1,'主神崛起','文抄公','完本','签约 游戏 游戏异界','258.75万','肆意挥洒激情的游戏人生，打破现实框架的无尽幻想！','一觉醒来穿越成反派？这剧本不对！还抢了人家的妹子？又有一个强势的姐姐？剧本更不对了！居然还有主神空间，诸天万界？我一定是在做梦！吴明淡定地木着脸，继续着征程。'),
(NULL,'武道宗师','爱潜水的乌贼','完本','签约 VIP 玄幻 异界大陆','251.39万','心潮澎湃，无限幻想，迎风挥击千层浪，少年不败热血！','在这里，武道不再是虚无缥缈的传说，而是切切实实的传承，经过与科技的对抗后，彻底融入了社会，有了各种各样的武道比赛，文无第一，武无第二！楼成得到武道一大流派断绝的传承后，向着最初的梦想，向着心里的荣耀，一步一步前进，都市之中仍有豪侠，当今时代依存英雄！'),
(NULL,'圣墟','辰东','连载','签约 VIP 玄幻 东方玄幻','465.66万','在破败中崛起，在寂灭中复苏。沧海成尘，雷电枯竭……','在破败中崛起，在寂灭中复苏。沧海成尘，雷电枯竭，那一缕幽雾又一次临近大地，世间的枷锁被打开了，一个全新的世界就此揭开神秘的一角……'),
(NULL,'万妖圣皇','胖头鱼','完结','东方玄幻','319.83万','弱肉强食，宁有种乎','弱肉强食，宁有种乎？妖族，天生卑微？妖族，只配奴役？妖族，永远只能藏匿于白山黑水之间？不！十万大山之中，少年仰天咆哮，崛起于宗门小派，征战于九州大陆。他誓要为妖族正名，上古血脉，万妖臣服！'),
(NULL,'唐砖','子与2','完本','历史','446万','醒掌天下权，醉卧美人膝，五千年风华烟雨，是非成败转头空！','梦回长安，鲜血浸染了玄武门，太极宫的深处只有数不尽的悲哀，民为水，君为舟，的朗朗之音犹在长安大地回绕，异族的铁蹄却再一次踏破了玉门关，此恨何及？坟墓里的李世民眼见子民涂炭，该发出怎样的怒号？栏杆拍遍，只能见九州陆沉！胸中也充满郁闷之气，恨不能跨越历史长河，摘飞星，揽日月，让乾坤倒转。也罢，耳听得窗外鬼鸣啾啾，秋雨婆娑，剪一枝秃笔，为李唐盛世延篇，去掉阴暗的部分，我的大唐没有悲哀，只有金戈铁马的豪情，气吞日月的帝王，百战浴血的猛将，高冠博带的高士，温婉贤淑的皇后，父慈子孝，盛世延绵，这是我的大唐，我的《唐砖》。'),
(NULL,'农门辣娘子','游走的小溪','连载','签约 VIP 古代言情 经商种田','58.49万','青砖绿瓦，陌上花开香染衣；朱门紫殿，素手摘星霓作裳。','两世同名，都是花骨朵一样的年纪。容貌？当然也是花儿一样美了。可惜，她这朵小花一睁开眼就要面临即将饿死的命运。挖野菜，卖草药，混市井，为了能多赚一口吃的，她早忘了自己原本是个美人儿。某日一个长相俊朗的猎人强行闯入了她的生活，还强行要娶她为妻。算他慧眼识珠，就在她想变回美人好与之相配时，却突然冒出来一个女人想和她抢相公。都说温饱思……那什么，她现在吃得饱，穿的暖，自然不会把这么好的男人让出去。'),
(NULL,'你和我的倾城时光','丁墨','完本','签约 VIP 现代言情 都市生活','37.44万','重生花样年华，玩转市井豪门，携手逆袭人生，共揽一世风云！','林浅曾经以为，自己想要的男人应当英俊、强大，在商界翻手为云覆手为雨，令她仰望，无所不能　可真遇到合适的人才发觉她是这么喜欢他的清冷、沉默、坚毅和忠诚喜欢到愿意跟他一起，在腥风血雨的商场并肩而立，肆意年华，不问前程')
;


