<template>
	<div id="service">
		<p class="title">用户注册协议</p>
		<div class="content">
			<span class="txt">提示条款</span>
			<p>　　您好！欢迎您与“大美软装”签订用户协议(以下称本协议)并使用“大美软装”提供的服务。“大美软装”是深圳兴汇大美网络科技有限公司旗下面向家居软装装修服务行业的网络服务提供平台。您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款，您点击“注册”按钮后，本协议即构成对双方有约束力的法律文件。</p>
			<span class="txt">第1条：协议的订立</span>
			<p>　　1.1 “大美软装”网络服务的所有权和运作权归深圳兴汇大美网络科技有限公司所有，“大美软装”同意按照本协议的规定及其不时发布的操作规则提供基于互联网的相关服务（以下称"网络服务"）。</p>
			<p>　　1.2 为获得网络服务，您同意根据注册页面的要求提供相应的有效信息，并设置登陆密码；您对您所提供全部信息的真实、完整和准确自负其责。您合法、完整并有效提供注册所需信息，获得的账号和密码，用于您登陆官网或其他服务平台。您获得账号及密码时视为您注册成功，表示您同意接受本协议的所有条款，成为“大美软装”的“用户”，且将受本协议的条款和条件约束，此协议即生效。阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，应立即停止注册程序。</p>
			<p>　　1.3 您确认，在您开始注册程序前，您应当具备中华人民共和国法律规定的与您行为相适应的民事权利能力和民事行为能力。若您不具备前述与您行为相适应的民事权利能力和民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。</p>
			<span class="txt">第2条：网络服务内容</span>
			<p>　　2.1 深圳兴汇大美网络科技有限公司运用自己的操作系统通过互联网络为您提供家居软装设计、购买平台，具体内容由“大美软装”根据实际情况提供。</p>
			<p>　　2.2 您可以通过“大美软装”查阅家居软装装修信息，应用“大美软装”提供的功能进行操作，并过“大美软装”与“大美软装”上商家和设计师联系家居软装装修事宜。</p>
			<p>　　2.3 “大美软装”保留随时变更、中断或终止部分或全部网络服务的权利。</p>
			<p>　　2.4 “大美软装”提供的网络服务内容可能包括：文字、软件、声音、图片、录像、图表等。所有这些内容受版权、商标和其它财产所有权法律的保护。</p>
			<p>　　2.5 您只有在获得“大美软装”或其他相关权利人的授权之后才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。您不得以违反法律法规、损害他人利益或破坏“大美软装”活动秩序的目的使用上述内容。</p>
			<p>　　2.6 “大美软装”上的商品价格、数量、是否有货等商品信息随时都有可能发生变动，本平台不作特别通知。由于平台上商品信息的数量及其庞大，虽然本平台会尽最大努力保证您所浏览商品信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本平台显示的信息可能会有一点的滞后或差错，对此情形您知悉并理解；大美软装欢迎纠错，并会视情况给予纠错者的奖励。“大美软装”有权在发现其网站上的商品及订单的明显误解、错误或缺货的情况下，单方面撤回任何商品信息、服务承诺或订购价格。同时，“大美软装”保留对商品订购的数量的限制权。</p>
			<p>　　2.7 “大美软装”向所有用户免费开放，但“大美软装”保留服务收费的权利；“大美软装”部分服务项目需收取服务费，用户有权决定是否使用并接受该收费服务。</p>
			<span class="txt">第3条：用户责任与义务</span>
			<p>　　3.1 您必须自行准备访问“大美软装”的设备，包括个人IAPD一台及其他上网装置。</p>
			<p>　　3.2 您自行支付上网的相关费用。您因进行交易、向“大美软装”获取有偿服务或接触“大美软装”服务器而发生的所有应纳税赋，以及由此产生的包括但不限于一切相关硬件、软件、服务及其他方面的费用均由您自己负责支付。</p>
			<p>　　3.3 应当依“大美软装”注册表所提示内容提供您本人真实、正确、最新及完整的资料；</p>
			<p>　　3.4 维持更新您的个人信息，确保其真实、正确、最新及完整。若您提供任何错误、不实、过时或不完整的资料，并为“大美软装”所确知，或者“大美软装”有合理的理由怀疑前述资料错误、不实、过时或不完整，“大美软装”有权暂停或终止您的帐号，并拒绝您于现在和未来使用“大美软装”全部或部分的服务。您提供虚假资料所造成的一切后果由您自己承担，而“大美软装”仅作为您在网上发布和刊登“用户资料”的被动渠道。（“用户资料”系指您在注册、登陆过程中、在任何公开信息场合或通过任何电子邮件形式，向“大美软装”提供的任何资料，包括但不限于数据、文本、软件、音乐、声响、照片、图画、影像、词句和其他材料。）</p>
			<p>　　3.5 您提供的注册信息不得冒用他人信息或侵犯他人合法权益。如果您有此类行为，“大美软装”有权暂停或终止帐号，并有权追究相关责任人的法律责任。</p>
			<p>　　3.6 您注册的用户名不能侵犯他人合法权益，不能对他人名誉权造成侵犯。“大美软装”有权收回对“大美软装”或者他人合法权益有侵犯嫌疑的帐号。</p>
			<p>　　3.7 您同意接受“大美软装”通过电子邮件或其他方式向您发送商品促销或其他相关商业信息。</p>
			<p>　　3.8 您在使用“大美软装”服务过程中，您必须遵循以下原则：</p>
			<p class="p1">　　　　1)	遵守中华人民共和国有关的法律和法规；</p>
			<p class="p1">　　　　2)	不得为任何非法目的而使用网络服务系统；</p>
			<p class="p1">　　　　3)	遵守所有与网络服务有关的网络协议、规定和程序；</p>
			<p class="p1">　　　　4)	不得利用“大美软装”服务系统进行任何可能对互联网的正常运转造成不利影响的行为；</p>
			<p class="p1">　　　　5)	不得利用“大美软装”服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</p>
			<p class="p1">　　　　6)	不得利用“大美软装”服务系统进行任何不利于“大美软装”的行为；</p>
			<p class="p1">　　　　7)	如发现任何非法使用您帐号或帐号出现安全漏洞的情况，应立即通告“大美软装”。</p>
			<p>　　用户应不时关注并遵守本站不时公布或修改的各类合法规则规定。本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。若用户未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户账号等措施。用户须对自己在网上的言论和行为承担法律责任。</p>
			<span class="txt">第4条：隐私制度</span>
			<p>　　4.1 尊重您的个人隐私是“大美软装”的一项基本制度。所以，作为对您注册资料分析的补充，“大美软装”不会在未经您授权时公开、编辑或透露您的注册资料及保存在“大美软装”中的非公开内容。除非以下情况：</p>
			<p class="p1">　　　　1)	根据法律、法规规定及按照有权机关的要求；</p>
			<p class="p1">　　　　2)	为了维护“大美软装”的合法利益；</p>
			<p class="p1">　　　　3)	为了维护用户个人利益和社会公共利益；</p>
			<p class="p1">　　　　4)	符合其他相关的要求。</p>
			<p>　　4.2 “大美软装”可能会与第三方合作向您提供相关的网络服务，在此情况下，如该第三方同意承担与“大美软装”同等的保护用户隐私的责任，则“大美软装”有权将您的注册资料等提供给该第三方。</p>
			<p>　　4.3 在不透露单个用户隐私资料的前提下，“大美软装”有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
			<span class="txt">第5条：订单</span>
			<p>　　5.1 在您下订单时，请您仔细确认所购商品的名称、价格、数量、型号、规格、尺寸、联系地址、电话、收货人等信息。收货人与用户本人不一致的，收货人的行为和意思表示视为用户的行为和意思表示，用户应对收货人的行为及意思表示的法律后果承担连带责任。如您下的是设计订单，请你仔细确认所选设计师的收费标准、所需设计的空间并尽可能的详细留言您对空间设计的想法及其概念。</p>
			<p>		5.2 除去法律另有强制性规定外，双方约定如下：本平台上销售方展示的商品和价格等信息仅仅是交易信息的发布，您下单时须填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址等内容。系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，仅是您向销售方发出的交易诉求；销售方收到您的订单信息后，只有在销售方将您在订单中订购的商品从仓库实际直接向您发出时（以商品出库为标志），方视为您与销售方之间就实际直接向您发出的商品建立了交易关系；如果您在一份订单里订购了多种商品并且销售方只给您发出部分商品时，您与销售方之间仅就实际向您发出的商品建立了交易关系；只有在销售方实际直接向您发出了订单中订购的其他商品时，您和销售方之间就订单中该其他已实际直接向您发出的商品才成立交易关系。您可以随时登录您在本平台注册的账户，查询您的订单状态。</p>
			<p>		5.3 由于市场变化及各种以合理商业努力难以控制的因素的影响，本平台无法保证您提交的订单信息中希望购买的商品会有货；如您拟购买的商品、发现缺货，您有权取消订单。</p>
			<p>		5.4 您在使用“大美软装”家居装修服务中定作类服务时，“大美软装”可以向您收取不超过定作类服务主合同标的额30%的定金作为订立合同的担保。如因给付定金一方原因要求解除合同的，给付定金一方无权要求返还定金。</p>
			<span class="txt">第6条：协议的变更</span>
			<p>“大美软装”将可能不定期的修改本协议的有关条款，一旦条款及服务内容产生变动，“大美软装”将会在重要页面上提示修改内容。修改后的服务条款自在网页上公布之时起生效，成为本协议之一部分。如果不同意“大美软装”对条款内容所做的修改，您可以主动取消获得的网络服务。如果您继续使用“大美软装”的服务，则视为接受和自愿遵守修改后的服务条款。“大美软装”保留随时修改或中断服务而不需告知您的权利。“大美软装”行使修改或中断服务的权利，不需对您或第三方负责。</p>
			<span class="txt">第7条：协议的终止</span>
			<p>　　7.1 您对条款修改有异议，或对“大美软装”的服务不满，可以行使如下权利： </p>
			<p class="p1">　　　　1)	停止使用“大美软装”的网络服务；</p>
			<p class="p1">　　　　2)	通告“大美软装”终止全部对您的服务。终止您的服务后，您使用网络服务的权利立即终止。</p>
			<p>　　7.2 依据本协议约定注销用户账号的，账号注销之日本协议同时终止。</p>
			<p>　　7.3 依据本协议约定终止全部服务的，服务终止之日本协议同时终止。</p>
			<p>　　7.4本协议终止后，您无权要求继续提供服务或履行义务：本协议的终止不影响守约方向违约方追究违约责任。</p>
			<span class="txt">第8条：账户，密码和安全性</span>
			<p>　　8.1 您一旦注册成功，成为“大美软装”的合法用户，将得到一个密码和用户名。您需维持账户和密码之安全。同时，由于“大美软装”无法对非法或未经您授权使用您账号及密码之行为进行甄别，您需对任何利用该专属您的账号和密码项下所有行为和事件负全责，“大美软装”不承担任何责任。但您若发现任何非法使用您账户或存在安全漏洞的情况，应毫不迟疑地立即通告“大美软装”，“大美软装”将尽最大努力协助您阻止损害结果发生。</p>
			<p>　　8.2 “大美软装”账号使用权仅属于初始注册人，禁止赠与、借用、租用、转让或售卖。如果“大美软装”发现使用者并非账号初始注册人，“大美软装”有权在未经通知的情况下回收该账号而无需向该账号使用人承担法律责任。“大美软装”禁止您私下有偿或无偿转让账号，以免因账号问题产生纠纷，您应当自行承担因违反此要求而遭致的任何损失，同时“大美软装”保留追究上述行为人法律责任的权利。</p>
			<p>　　8.3 如发生利用计算机程序等其他技术手段进行恶意注册、邀请、参与的情形，“大美软装”有权在不事先通知您的情况下单方面中断或终止向您提供服务而无需通知您。</p>
			<span class="txt">第9条：拒绝提供担保</span>
			<p>　　您个人对网络服务的使用承担风险，“大美软装”对此不作任何类型的担保，不论是明确的或隐含的，但是不对商业性的隐含担保、特定目的和不违反规定的适当担保作限制。“大美软装”不担保服务一定能满足您的要求，也不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保。“大美软装”对在“大美软装”上得到的任何商品购物服务或交易进程，不作担保。</p>
			<span class="txt">第10条：有限责任</span>
			<p>　　10.1 “大美软装”对网络服务不承担任何责任，即由您对网络服务的使用承担全部风险。</p>
			<p>　　10.2 “大美软装”对任何直接、间接、偶然、特殊及继起的损害不负责任，这些损害可能来自：您不正当使用网络服务，非法使用网络服务或您传送的信息有所变动等。</p>
			<p>　　10.3 “大美软装”系统因下列状况无法正常运作，使您无法使用各项服务时，“大美软装”不承担损害赔偿责任，该状况包括但不限于：</p>
			<p class="p1">　　　　1)	“大美软装”在本网站公告之系统停机维护期间。</p>
			<p class="p1">　　　　2)	电信设备出现故障不能进行数据传输的。</p>
			<p class="p1">　　　　3)	因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成“大美软装”系统障碍不能执行业务的。</p>
			<p class="p1">　　　　4)	由于黑客攻击、电信部门技术调整或故障、网站升级方面的问题等原因而造成的服务中断或者延迟。</p>
			<p>　　10.4 “大美软装”如提供其他网站或资源的链接，由于“大美软装”并不控制该等网站和资源，您承认并同意，“大美软装”不保证因向您提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不是“大美软装”控制的任何网页上的内容，任何因使用或信赖此类网站或资源上获取的此类内容、宣传、产品、服务或其他材料而造成（或声称造成）的任何直接或间接损失，或由此对第三方构成侵权的，“大美软装”不承担任何责任。</p>
			<span class="txt">第11条：违约责任</span>
			<p>　　11.1 “大美软装”或您违反本协议的约定即构成违约，违约方应当向守约方承担违约责任。</p>
			<p>　　11.2 发生以下情形的，则“大美软装”有权注销您账号，终止为您提供网络服务，如“大美软装”因此而遭受损失的，有权要求您赔偿损失：</p>
			<p class="p1">　　　　1)	您违反本协议约定，在“大美软装”或利用“大美软装”服务从事非法活动的；</p>
			<p class="p1">　　　　2)	因您提供的信息不真实、不完整或不准确给“大美软装”造成损失的：</p>
			<p class="p1">　　　　3)	您以技术手段干扰“大美软装”的运行或干扰其他用户对“大美软装”使用的。</p>
			<p>　　您有上述情形，并对第三方造成损失的，“大美软装”有权要求您对受损失方进行赔偿。</p>
			<p>　　11.3 如您以虚构事实等方式恶意诋毁“大美软装”或第三方的信誉，“大美软装”有权要求您向“大美软装”或第三方公开道歉，赔偿您给“大美软装”或第三方造成的损失，并有权终止对您提供“大美软装”服务。</p>
			<span class="txt">第12条：法律适用和管辖</span>
			<p>　　本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</p>
			<p>　　如发生本协议服务条款与中华人民共和国法律相抵触时，则这些条款将完全按中华人民共和国法律规定重新解释，而其它合法条款则依旧保持对您产生法律效力和影响。</p>
			<p>　　本协议的规定是可分割的，如本协议任何规定被认定为无效或不可执行，该规定可被删除而其余条款应予以执行。</p>
			<p>　　如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向深圳兴汇大美网络科技有限公司所在地人民法院提起诉讼。</p>
			<p class="fr">深圳兴汇大美网络科技有限公司</p>
		</div>
	</div>
</template>
<script></script>
<style lang="less" scoped>
	@import '../../assets/mixin.less';
	#service {
		.title {
			width: 100%;
			.rem(padding-top,30);
			.rem(padding-bottom,30);
			.rem(line-height,32);
			.rem(font-size,32);
			color: #333;
			text-align: center;
			.border(border-top,4,#eee);
		}
		.content {
			.rem(padding-left,30);
			.rem(padding-right,30);
			color: #999;
		}
		.txt {
			.rem(line-height,44);
			.rem(font-size,24);
			color: #333;
		}
		p {
			.rem(line-height,44);
			.rem(font-size,22);
		}
		.p1 {
			.rem(font-size,20);
		}
	}
</style>